In [5]:
"""
None: pythonic missing data
"""
import numpy as np
import pandas as pd
# none 객체는 object 타입인 배열에서만 사용 
# object 타입은 numpy pandas 에 대한 연산이 호환되지 않음 
arr1 = np.array([1,None,3,4])
arr1

array([1, None, 3, 4], dtype=object)

In [7]:
"""
nan: missing numerical data
"""
arr3 = np.array([1,np.nan,3,4])
arr3.dtype

dtype('float64')

In [8]:
1+ np.nan

nan

In [9]:
arr3.sum()

nan

In [10]:
np.nansum(arr3)

8.0

In [11]:
#nan and none in pandas 
ser = pd.Series([1, np.nan, 2, None])
ser

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [12]:
"""
operating on null values
"""
#detecting null values
ser = pd.Series([1,np.nan,'hello', None])
ser.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [13]:
ser.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [15]:
"""
dropping null values
"""
#dropna()
df = pd.DataFrame([[1,np.nan,2],
                  [2,3,5],
                  [np.nan, 4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [16]:
#axis
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [18]:
#how 
df.dropna(axis = 'columns', how ='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [19]:
#thresh= 임계치를 통해 삭제될 것 선택
df.dropna(axis='rows', thresh =3)

     0    1  2
1  2.0  3.0  5

In [23]:
"""
filling null values
"""
ser = pd.Series([1,np.nan,2,None,3],
               index=list('abcde'))
ser

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [22]:
#fillna()  = null 값을 다른 값으로 대체 
ser.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [24]:
#forward-fill = LOCF -> 결측 직전 값으로 대체 
ser.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [27]:
#backward-fill =NOCB -> 결측 직후 깂으로 대체 
ser.bfill()

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64